In [146]:
import pandas as pd
import numpy as np

In [147]:
csv = pd.read_csv('oil.csv')

ts = pd.DataFrame([])

In [148]:
month = ['Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun', 'Jul', 'Aug', 'Sep', 'Oct', 'Nov', 'Dec']

for year in range(1988, 2019):

    df = pd.DataFrame(csv[csv.Year == year])

    df.reset_index(inplace=True)

    df = df.drop(['index'], axis=1)

    Jan=[];Feb=[];Mar=[];Apr=[];May=[];Jun=[];Jul=[];Aug=[];Sep=[];Oct=[];Nov=[];Dec=[];

    for row in df.index:
        i = df.Date.iloc[row]
        if arr[0] in i:
            Jan.append(df.Price.iloc[row])
        if arr[1] in i:
            Feb.append(df.Price.iloc[row])
        if arr[2] in i:
            Mar.append(df.Price.iloc[row])
        if arr[3] in i:
            Apr.append(df.Price.iloc[row])
        if arr[4] in i:
            May.append(df.Price.iloc[row])
        if arr[5] in i:
            Jun.append(df.Price.iloc[row])
        if arr[6] in i:
            Jul.append(df.Price.iloc[row])
        if arr[7] in i:
            Aug.append(df.Price.iloc[row])
        if arr[8] in i:
            Sep.append(df.Price.iloc[row])
        if arr[9] in i:
            Oct.append(df.Price.iloc[row])
        if arr[10] in i:
            Nov.append(df.Price.iloc[row])
        if arr[11] in i:
            Dec.append(df.Price.iloc[row])

    Jan.sort()
    Feb.sort()
    Mar.sort()
    Apr.sort()
    May.sort()
    Jun.sort()
    Jul.sort()
    Aug.sort()
    Sep.sort()
    Oct.sort()
    Nov.sort()
    Dec.sort()

    max_values = [Jan[-1], Feb[-1], Mar[-1], Apr[-1], May[-1], Jun[-1], Jul[-1], Aug[-1], Sep[-1], Oct[-1], Nov[-1], Dec[-1]]

    new_year = pd.period_range(str(year), periods=12, freq='M')

    ts = ts.append(list(zip(new_year, max_values)))

In [149]:
ts.head()

         0      1
0  1988-01  17.95
1  1988-02  16.50
2  1988-03  15.70
3  1988-04  17.45
4  1988-05  16.60

In [150]:
ts.tail()

          0      1
7   2018-08  77.05
8   2018-09  82.72
9   2018-10  86.07
10  2018-11  72.68
11  2018-12  61.71

In [151]:
ts.columns = ['Date', 'Price']

ts = ts.set_index('Date')

ts.to_csv('oil_months.csv')